MikroElektronika/core_packages/PIC/XC8/def/PIC18F66K22/mcu.h
// Register: TMR3H
#define TMR3H TMR3H
extern volatile unsigned char           TMR3H               __at(0xFB3);
#ifndef _LIB_BUILD
asm("TMR3H equ 0FB3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR3H                  :8;
    };
} TMR3Hbits_t;
extern volatile TMR3Hbits_t TMR3Hbits __at(0xFB3);
// bitfield macros
#define _TMR3H_TMR3H_POSN                                   0x0
#define _TMR3H_TMR3H_POSITION                               0x0
#define _TMR3H_TMR3H_SIZE                                   0x8
#define _TMR3H_TMR3H_LENGTH                                 0x8
#define _TMR3H_TMR3H_MASK                                   0xFF

// Register: CMSTAT
#define CMSTAT CMSTAT
extern volatile unsigned char           CMSTAT              __at(0xFB4);
#ifndef _LIB_BUILD
asm("CMSTAT equ 0FB4h");
#endif
// aliases
extern volatile unsigned char           CMSTATUS            __at(0xFB4);
#ifndef _LIB_BUILD
asm("CMSTATUS equ 0FB4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :5;
        unsigned CMP1OUT                :1;
        unsigned CMP2OUT                :1;
        unsigned CMP3OUT                :1;
    };
    struct {
        unsigned                        :5;
        unsigned C1OUT                  :1;
        unsigned C2OUT                  :1;
        unsigned C3OUT                  :1;
    };
} CMSTATbits_t;
extern volatile CMSTATbits_t CMSTATbits __at(0xFB4);
// bitfield macros
#define _CMSTAT_CMP1OUT_POSN                                0x5
#define _CMSTAT_CMP1OUT_POSITION                            0x5
#define _CMSTAT_CMP1OUT_SIZE                                0x1
#define _CMSTAT_CMP1OUT_LENGTH                              0x1
#define _CMSTAT_CMP1OUT_MASK                                0x20
#define _CMSTAT_CMP2OUT_POSN                                0x6
#define _CMSTAT_CMP2OUT_POSITION                            0x6
#define _CMSTAT_CMP2OUT_SIZE                                0x1
#define _CMSTAT_CMP2OUT_LENGTH                              0x1
#define _CMSTAT_CMP2OUT_MASK                                0x40
#define _CMSTAT_CMP3OUT_POSN                                0x7
#define _CMSTAT_CMP3OUT_POSITION                            0x7
#define _CMSTAT_CMP3OUT_SIZE                                0x1
#define _CMSTAT_CMP3OUT_LENGTH                              0x1
#define _CMSTAT_CMP3OUT_MASK                                0x80
#define _CMSTAT_C1OUT_POSN                                  0x5
#define _CMSTAT_C1OUT_POSITION                              0x5
#define _CMSTAT_C1OUT_SIZE                                  0x1
#define _CMSTAT_C1OUT_LENGTH                                0x1
#define _CMSTAT_C1OUT_MASK                                  0x20
#define _CMSTAT_C2OUT_POSN                                  0x6
#define _CMSTAT_C2OUT_POSITION                              0x6
#define _CMSTAT_C2OUT_SIZE                                  0x1
#define _CMSTAT_C2OUT_LENGTH                                0x1
#define _CMSTAT_C2OUT_MASK                                  0x40
#define _CMSTAT_C3OUT_POSN                                  0x7
#define _CMSTAT_C3OUT_POSITION                              0x7
#define _CMSTAT_C3OUT_SIZE                                  0x1
#define _CMSTAT_C3OUT_LENGTH                                0x1
#define _CMSTAT_C3OUT_MASK                                  0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned                        :5;
        unsigned CMP1OUT                :1;
        unsigned CMP2OUT                :1;
        unsigned CMP3OUT                :1;
    };
    struct {
        unsigned                        :5;
        unsigned C1OUT                  :1;
        unsigned C2OUT                  :1;
        unsigned C3OUT                  :1;
    };
} CMSTATUSbits_t;
extern volatile CMSTATUSbits_t CMSTATUSbits __at(0xFB4);
// bitfield macros
#define _CMSTATUS_CMP1OUT_POSN                              0x5
#define _CMSTATUS_CMP1OUT_POSITION                          0x5
#define _CMSTATUS_CMP1OUT_SIZE                              0x1
#define _CMSTATUS_CMP1OUT_LENGTH                            0x1
#define _CMSTATUS_CMP1OUT_MASK                              0x20
#define _CMSTATUS_CMP2OUT_POSN                              0x6
#define _CMSTATUS_CMP2OUT_POSITION                          0x6
#define _CMSTATUS_CMP2OUT_SIZE                              0x1
#define _CMSTATUS_CMP2OUT_LENGTH                            0x1
#define _CMSTATUS_CMP2OUT_MASK                              0x40
#define _CMSTATUS_CMP3OUT_POSN                              0x7
#define _CMSTATUS_CMP3OUT_POSITION                          0x7
#define _CMSTATUS_CMP3OUT_SIZE                              0x1
#define _CMSTATUS_CMP3OUT_LENGTH                            0x1
#define _CMSTATUS_CMP3OUT_MASK                              0x80
#define _CMSTATUS_C1OUT_POSN                                0x5
#define _CMSTATUS_C1OUT_POSITION                            0x5
#define _CMSTATUS_C1OUT_SIZE                                0x1
#define _CMSTATUS_C1OUT_LENGTH                              0x1
#define _CMSTATUS_C1OUT_MASK                                0x20
#define _CMSTATUS_C2OUT_POSN                                0x6
#define _CMSTATUS_C2OUT_POSITION                            0x6
#define _CMSTATUS_C2OUT_SIZE                                0x1
#define _CMSTATUS_C2OUT_LENGTH                              0x1
#define _CMSTATUS_C2OUT_MASK                                0x40
#define _CMSTATUS_C3OUT_POSN                                0x7
#define _CMSTATUS_C3OUT_POSITION                            0x7
#define _CMSTATUS_C3OUT_SIZE                                0x1
#define _CMSTATUS_C3OUT_LENGTH                              0x1
#define _CMSTATUS_C3OUT_MASK                                0x80

// Register: CVRCON
#define CVRCON CVRCON
extern volatile unsigned char           CVRCON              __at(0xFB5);
#ifndef _LIB_BUILD
asm("CVRCON equ 0FB5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CVR                    :5;
        unsigned CVRSS                  :1;
        unsigned CVROE                  :1;
        unsigned CVREN                  :1;
    };
    struct {
        unsigned CVR0                   :1;
        unsigned CVR1                   :1;
        unsigned CVR2                   :1;
        unsigned CVR3                   :1;
        unsigned CVR4                   :1;
    };
    struct {
        unsigned                        :5;
        unsigned CVRR                   :1;
        unsigned CVROEN                 :1;
    };
} CVRCONbits_t;
extern volatile CVRCONbits_t CVRCONbits __at(0xFB5);
// bitfield macros
#define _CVRCON_CVR_POSN                                    0x0
#define _CVRCON_CVR_POSITION                                0x0
#define _CVRCON_CVR_SIZE                                    0x5
#define _CVRCON_CVR_LENGTH                                  0x5
#define _CVRCON_CVR_MASK                                    0x1F
#define _CVRCON_CVRSS_POSN                                  0x5
#define _CVRCON_CVRSS_POSITION                              0x5
#define _CVRCON_CVRSS_SIZE                                  0x1
#define _CVRCON_CVRSS_LENGTH                                0x1
#define _CVRCON_CVRSS_MASK                                  0x20
#define _CVRCON_CVROE_POSN                                  0x6
#define _CVRCON_CVROE_POSITION                              0x6
#define _CVRCON_CVROE_SIZE                                  0x1
#define _CVRCON_CVROE_LENGTH                                0x1
#define _CVRCON_CVROE_MASK                                  0x40
#define _CVRCON_CVREN_POSN                                  0x7
#define _CVRCON_CVREN_POSITION                              0x7
#define _CVRCON_CVREN_SIZE                                  0x1
#define _CVRCON_CVREN_LENGTH                                0x1
#define _CVRCON_CVREN_MASK                                  0x80
#define _CVRCON_CVR0_POSN                                   0x0
#define _CVRCON_CVR0_POSITION                               0x0
#define _CVRCON_CVR0_SIZE                                   0x1
#define _CVRCON_CVR0_LENGTH                                 0x1
#define _CVRCON_CVR0_MASK                                   0x1
#define _CVRCON_CVR1_POSN                                   0x1
#define _CVRCON_CVR1_POSITION                               0x1
#define _CVRCON_CVR1_SIZE                                   0x1
#define _CVRCON_CVR1_LENGTH                                 0x1
#define _CVRCON_CVR1_MASK                                   0x2
#define _CVRCON_CVR2_POSN                                   0x2
#define _CVRCON_CVR2_POSITION                               0x2
#define _CVRCON_CVR2_SIZE                                   0x1
#define _CVRCON_CVR2_LENGTH                                 0x1
#define _CVRCON_CVR2_MASK                                   0x4
#define _CVRCON_CVR3_POSN                                   0x3
#define _CVRCON_CVR3_POSITION                               0x3
#define _CVRCON_CVR3_SIZE                                   0x1
#define _CVRCON_CVR3_LENGTH                                 0x1
#define _CVRCON_CVR3_MASK                                   0x8
#define _CVRCON_CVR4_POSN                                   0x4
#define _CVRCON_CVR4_POSITION                               0x4
#define _CVRCON_CVR4_SIZE                                   0x1
#define _CVRCON_CVR4_LENGTH                                 0x1
#define _CVRCON_CVR4_MASK                                   0x10
#define _CVRCON_CVRR_POSN                                   0x5
#define _CVRCON_CVRR_POSITION                               0x5
#define _CVRCON_CVRR_SIZE                                   0x1
#define _CVRCON_CVRR_LENGTH                                 0x1
#define _CVRCON_CVRR_MASK                                   0x20
#define _CVRCON_CVROEN_POSN                                 0x6
#define _CVRCON_CVROEN_POSITION                             0x6
#define _CVRCON_CVROEN_SIZE                                 0x1
#define _CVRCON_CVROEN_LENGTH                               0x1
#define _CVRCON_CVROEN_MASK                                 0x40

